[
  {
    "name":"Ann Bowers, Florida",
    "bio":"Corinthian Colleges have been accused of predatory lending without consequences. Only the students have suffered. The Department of Education should have protected students. All we have for our commitment to education is huge debt and a degree that is of questionable credibility, thanks to the behavior of the Corinthian Corporation. We deserve to have all our debt erased and to get the quality education that we were promised. Furthermore, this education should be free! Many of us who attended Corinthian are in worse financial condition than before we started school. Corinthian and the investors who funded it should be paying our debts, and they should pay for us to get an education from a reputable college that is not-for-profit and that is regionally accredited. Corinthian officials and investors lined their pockets with our lifetime educational funding. Free quality education should be available to all people!"
  },
  {
    "name":"Natalie Cardinal, Salem, Oregon",
    "bio":"Why is the Department of Education trying to steal from Corinthian students? Why are they trying to collect on our debts? Some of our private loans have already been cancelled. Everyone knows this company was scamming people. Everyone knows this debt is illegitimate. Yet, I am being harassed by collectors on a daily basis. Those collectors are working for the Department of Education who expect me to pay. The stress and anxiety is nearly unbearable. My Pell grant was paid out to investors who own Corinthian. The public needs to know more about this scandal. When will students get justice?  \n"
  },
  {
    "name":"Latonya Suggs, Cincinnati, OH",
    "bio":"I was excited to attend Everest College online because they promised to help me find a well-paying career. But they lied to me and took my money. Not only did the school fail me, but the Department of Education failed me because it is their responsibility to make sure that these schools provide a quality education at an affordable cost at a scam-free school. I took out thousands in loans so that I could make a better life for my son. I earned a criminal justice degree that most employers do not even recognize. I am completely lost and in debt. The only solution is for the Department of Education to discharge my loan so I can start over. I deserve free tuition for the time I wasted. In fact, all student debtors should join together to demand debt cancellation and free education. We are not going to stop fighting until we win. That’s what this strike is about."
  },
  {
    "name":"Mallory Heiney",
    "bio":"I didn't always want to be a nurse. But after I went overseas to do mission work in Africa, I got inspired and realized there's nothing I would rather do than help others. I enrolled in Everest Grand Rapids to earn my degree. A few months after I enrolled, we started hearing rumors that the campus was shutting down. At first, the administors at the campus denied it. But eventually, our President came into class and confirmed that our school was closing. She had a form for us to sign. There is a provision in the law that says closing colleges should offer students the opportunity to get a complete discharge of their loans. Instead of allowing us that option, we were pressured us into signing away our right to make a free choice. We were told we had to stay in the failing program and repay our student loans. I told the President that I wanted to withdraw. But she took me into an office and pressured me even further, insisting that I did not know my own mind. I refused to sign the form. But I was told that I could not withdraw. I wrote a letter of appeal, demanding a discharge of my debt. But my appeal was also denied. I was never given an adequate explanation. Now, I have thousands in debt from an institution that no longer exists. My credits won't transfer. The only way we can take back the rights that were denied to us is by joining together and demanding that the Department of Education cancel our loans."
  },
  {
    "name":"Hollie Chaffee, Kalamazoo, MIchigan",
    "bio":"I was lied to and defrauded by Everest College. I feel like they stole my money. Soon, the college will no longer exist. The campuses have been purchased by a debt collection company. But the Department of Education is demanding that I pay my debt. Why should I pay? Why doesn't the Corinthian corporation pay me? I was supposed to receive training to get a job as a  medical assistant. But as soon as I was no longer eligible for student loans, Everest stopped returning my calls. They suddently acted like I didn't exist. Corinthian ruined entire families. My daugher also attended Everest. She was pressured into earning an expensie degree that she didn't need to enter a field where jobs are few and far between. I am fighting for myself but i am also fighting for my daughter and for all families whose children are in more student debt than they can ever repay. "
  },
  {
    "name":"Paul Hicks, Mont Belvieu, Texas",
    "bio":"I have worked for 30 years in public service, including in private security, in the Texas Army National Guard, the Texas Department of Corrections, and the Texas National Guard. I started at Everest in May 2009 and graduated with an Associate Degree in 2012. For three years after graduation, the college refused to give me my diploma because I had an overdue balance. It took me almost six years in total to get a $48,000 degree. Now, all I have for my hard work and mounting debt are a piece of worthless paper. The Department of Education should have protected students from these predators. As a public servant, I am appalled that the Department of Education is lining its pockets with our hard work and money. We deserve to have all our debt erased, and the schools in question should be closed for good. I will fight with other students until our demands are met. "
  },
  {
    "name":"Natasha Hornes, Columbia, MO",
    "bio":"I attended Everest in California where I earned a Paralegal degree. I earned consistently high grades and was on the Dean's list. But Everest won't release my diploma because I owe them a few hundred dollars in fees. That is in addition to the thousands in student loans that I won't pay. I was never able to find a job after college. I can't even afford the monthly interest payments on my debt. And even if I could afford to pay, I refuse to do so because I was coerced into taking out these loans. Some Everest students were pulled out of class and told they could not return unless they signed loan paperwork. Other times, loan officers came into class and made us stop what we were doing to sign financial aid forms. We were told that we had no choice. If we didn't sign, we couldn't stay in school. No one who profited from the scam will be punished. I refuse to pay, and I know I am not alone. I am joining with others and calling on the Department of Education to cancel this illegitimate debt and to offer all of us free tuition at a college of our choosing."
  },
  {
    "name":"Nathan Hornes II, Los Angeles, CA",
    "bio":"I graduated from Everest with a Bachelor’s degree in Business and a 3.9 GPA. But today I work two minimum wage jobs. I owe $78,000 in student loan debt even though Everest is being sued for fraud. Still, the Department of Education has refused to cancel my debt. I want to know -- why is the Department of Education supporting a scam for-profit school instead of students? I am on strike because I deserve a full refund and a free education. I co-founded a group called the Everest Avengers where Corinthian students are planning a long-term battle against Corinthian and the Department of Education. There are 40 million student debtors across the country. This is only the beginning. If we all join together, imagine how much power we would have to end student debt for good."
  },
  {
    "name":"Jessica Madison, Clearwater, Florida",
    "bio":"I started at Everest in 2005, when it was still called Florida Metropolitan. I had been out of high school for a while, and I was ready to start a new career as a Paralegal. Admissions officers at Everest promised that I would receive job placement. But after completing all my courses, the only help they gave me was to send me job ads that I could have found myself on Craigslist. After going $33,000 in debt, I was not able to officially graduate because I owed the school money. Still, I didn't give up. I moved to a new state to try and look for work in the Paralegal field. But I ended up worse off than I was before I went to Everest. My tax refund has been garnished by debt collectors for years. And my wages are now being garnished by a debt collection agency called Education Credit Management Corp. Later, I discovered that ECMC is the same company that is buying dozens of Everest Campuses. They way I see it, ECMC can't lose. They make money if I pay my loans, and they make money if I don't. The only people who lose are the students. The entire scam is supported by the Department of Education, which approved the sale of Corinthian to ECMC. I want to know why the Department thinks the same company who is garnishing my wages should be running schools. Instead of supporting predatory lenders, the Department of Education should cancel my debt and the debt of all Corinthian students. "
  },
  {
    "name":"Amanda Shaffer, Morganton, North Carolina ",
    "bio":"Corinthian took more than $10,000 of my Pell Grant money. They pressured me to enroll in a four-year program so they could keep taking out loans in my name for as long as possible. I was disabled in an accident a few years ago and enrolling in an online college was my only option to get the education I dreamed of. Two years later I have learned nothing, and my debts have skyrocketed to over $20,000. And my Pell Grant funds are gone forever. The Corinthian business model was a high-tech mugging operation. Corinthian drained my Federal aid money dry and left me with nothing. And the Department of Education is helping them get away with it. They are even profiting from the scam. I say enough is enough. I will never pay these unjust debts."
  },
  {
    "name":"Ashlee Schmidt, Springhill FL",
    "bio":"I believed in the American Dream and that education was the key to achieving it. I was the first person in my family to attend college. I wanted to make my family proud and be able to take care of my disabled father. I studied hard and earned a 4.0 grade point average at Everest. Today, however, I am unemployed and can't find a job. I filled out a single FAFSA form, and Everest College continually took out loans in my name without my knowledge. (The tuition at Everest was so high that I also had to take out private Genesis loans just to stay in school. Everest also tried to get my father to co-sign for even more loans.) After graduation, I discovered that Everest took out as many as 13 loans in my name. I now owe $36,412. But the Department of Education has so far refused to cancel these debts. Corinthian and the investors who got rich off my Federal loans have suffered no consequences. Instead, the Department of Education is helping the company avoid punishment. I am on strike because the only way out of this debt is to join with others in my situation. I can't pay, and I won't pay. The Department of Education should cancel our debt and provide a quality, free education to everyone."
  },
  {
    "name":"DeAnda Wiley, Pilot Point, Texas",
    "bio":"I was in my 40s by the time I graduated with a Bachelors in Paralegal Studies. Everest took advantage of my inexperience and the fact that I needed to finish school quickly so I could begin my career. College is supposed to be a place where students study and learn in a supportive and intellectually stimulating environment. Since my classes took place completely online, I was robbed of that opportunity. I never met a fellow student or teacher during my time as a student. Though I studied hard and took my education seriously, high grades seemed easy to come by. I began to wonder if the teachers were legitmiate educators or if getting money out of me was the real goal. Now I can't start over at a new school because I owe too much. The Department of Education should cancel my debt and the debt of all Corinthian students. We should also get free tuition at a real college paid for by the people who profited from us. Until our demands are met, I won't pay these unjust debts."
  },
  {
    "name":"Dawn Thompson, Springfield, Illinois",
    "bio":"As a mother of two children, I could not attend a regular college. Everest guilted me into enrolling in an online program by playing on my emotions. They called me several times per week to convince me that I would be better able to provide for my kids if I earned a degree from their school. \"Why wait?\" they said. After I filled out the FAFSA, they began taking out loans in my name. After I started classes, Everest officials told me that I would have to sign up for a high-interest Genesis loan to stay in the program. That first loan was followed by a second one a short time later. The loans kept piling up. By the time I realized I had been led into a trap, it was too late. I know that some people got rich off my Federal aid money, including big banks like Wells Fargo. I know that the Department of Education stood by and let it happen. Now I am striking my loans with other Corinthian students. To the Department of Education I say, cancel our Federal loans. It's the right thing to do. Why wait?"
  },
  {
    "name":"Makenzie Vasquez, San Jose, CA",
    "bio":"I’m Makenzie from Santa Cruz , CA. I have thousands in debt from Everest. And I'm currently in default. College was foreign territory for me. Neither of my parents attended, so I was on my own when it came to understanding how the system works. Corinthian (Everest’s parent company) did a great job making me believe that they cared. I trusted them, and why not? Why would education fail me? I studied hard and did everything right. But Everest took all my Federal funding. They stole money from me that I didn’t even have, money that I can’t - and won’t - pay back. These debts are illegitimate because I never should have been charged that much to attend school in the first place. But the Department of Education refuses to cancel my loans. Who should have to pay for Corinthian’s misdeeds? Not me. How about Wells Fargo, Corinthian’s largest investor? Wells Fargo is a billion dollar corporation that profited from poverty. They should have to pay to cancel all Corinthian loans and fund free college for everyone led into this student debt trap. I'm here to make sure they are held accountable."
  },
  {
    "name":"Tasha Courtright, Lake Elsinore, California",
    "bio":"To the Department of Education: I've already called you out once at a hearing in Anaheim for funding a school you had been investigating since as early as 2007.  That day, I said that it shouldn't have taken seven years to come to the conclusion that the school is a scam. You let the scam continue for so long when the students could have avoided all of this debt with some notification from you. Since you haven't cancelled my debt yet, I'd like to ask you another question: How can you support a school whose degrees don't lead to living wage jobs and whose credits don't transfer? I wanted to be a teacher. But no one will accept my credits, and I can never get a teaching job with an Everest degree.  Corinthian is not above the law, but they act as if they are. Any one of us would be in prison if we had stolen even a fraction of the money that Everest stole from us. Why are they not being held liable? Why doesn't the government file criminal charges against them? Most of us who attended Everest are barely getting by. Why are you, the Department of Education, collecting on these loans? You're not makng any sense. If somebody can't pay, if it gets to the point where you have to garnish wages and tax returns, maybe we should be funding higher education differently. You are now threatening to take food out of my children's mouths and possibly making my family and other families homeless. Maybe another solution should be figured out. Maybe you, the Department of Education, should think harder about how to solve this problem. An honorable person will pay a debt they truly owe. But we don't owe you a single penny. \n"
  }
]