[
{"name":"Makenzie Vasquez, San Jose, CA","bio":"I’m Makenzie from Santa Cruz , CA. I have $40,000 in debt from Everest. And I'm currently in default. College was foreign territory for me. Neither of my parents attended, so I was on my own when it came to understanding how the system works. This was supposed to be a chance to make something of myself and to one day provide for my own family. Corinthian (Everest’s parent company) did a great job making me believe that they cared. I trusted them, and why not? Why would education fail me? Education is supposed to lead to the American Dream. I studied hard and did everything right. But Everest stole all my Federal funding. They stole money from me that I didn’t even have, money that I can’t - and won’t - pay back. These debts are illegitimate because I never should have been charged that much to attend school in the first place. A school that sold me a Dream that turned out to be a Nightmare. But the Department of Education refuses to cancel my loans. They are continuing to allow these schools to collect this money for a bogus degree. Who should have to pay for Corinthian’s crimes? Not me. We (the people) are the victims here. Why are we allowing this company to have mores right than we do? How about Wells Fargo, Corinthian’s largest investor? Wells Fargo is a billion dollar corporation that profited from poverty. They should have to pay to cancel all Corinthian loans and fund free college for everyone led into this student debt trap. Let's make sure they are held accountable!","image":""},
{"name":"Nathan Hornes, Los Angeles, CA","bio":"I’m from Los Angeles, CA. I graduated from Everest with a Bachelor’s degree in Business and a 3.9 GPA. But today I work two minimum wage jobs. I often work 18-hour days, because I cannot afford to pay my loans. I owe $78,000 in student loan debt even though Everest is being sued for fraud. Still, the DoE has refused to cancel my debt. I want to know -- why is the Department of Education supporting a scam for-profit school instead of students? I am on strike because I deserve a full refund and a free education. I co-founded a group called the Everest Avengers where Corinthian students are planning a long-term battle against Corinthian and the Department of Ed. There are 40 million student debtors across the country. This is only the beginning. If we all join together, imagine how much power we would have to end student debt for good.","image":""},
{"name":"Latonya Suggs, Cincinnati, OH","bio":"I’m from Cincinnati, Ohio. I was excited to attend Everest College online because they promised to help me find a well-paying career. But they lied to me and stole my money. Not only did the school fail me, but the Department of Education failed me because it is their responsibility to make sure that these schools provide a quality education at an affordable cost at a scam-free school. I took out $40,000 in loans so that I could make a better life for my infant son. I earned a criminal justice degree that most employers do not even recognize. After college, I took a job as a housekeeper making barely over minimum wage. I am completely lost and in debt. The only solution is for the Department of Education to discharge my loan so I can start over. I deserve free tuition for the time I wasted. In fact, all student debtors should join together to demand debt cancellation and free education. We are not going to stop fighting until we win. That’s what this strike is about.","image":""},
{"name":"Natasha Hornes, Columbia, MO","bio":"I attended Everest in California where I earned a Paralegal degree. I earned\nconsistently high grades and was on the Dean's list. But Everest won't\nrelease my diploma because I owe then $200 in fees. That is in addition to the $40,000 in student loans that I will never repay. I was never able to\nfind a job after college. I can't even afford the monthly interest payments,\nand even if could afford to pay, I won't pay. I was coerced into taking out\nthese loans. Some Everest students were pulled out of class and told they\ncould not return unless they signed loan paperwork. Other times, loan\nofficers came into class and made us stop what we were doing to sign\nfinancial aid forms. We were told that we had no choice. If we didn't sign,\nwe couldn't stay in school. Everest's parent company, Corinthian, broke the\nlaw and got rich turning public money into private profit. But no one who\nprofited from the scam will be punished. Instead, we, the students, are\nexpected to keep paying, maybe for the rest of our lives. I refuse to pay, and I know I am not alone. I am joining with others and calling on\nthe Department of Education to cancel this illegitimate debt and to offer\nall of us free tuition at a college of our choosing.","image":""},
{"name":"Patricia Bowers, Florida","bio":"People should not be taken advantage of because they have they desire to better themselves through education. Corinthian Colleges have been allowed to commit fraud and engage in predatory lending without consequences. Only the students have suffered the consequences. The Department of Education should have protected students from these criminals. All we have for our commitment to education is huge debt and a degree that is of questionable credibility, thanks to the fraudulent behavior of the Corinthian Corporation. We deserve to have all our debt erased and to get the quality education that we were promised. Furthermore, this education should be free! Big business and predatory lending have no place in education. Education should be equally available to all people, not only to the financially advantaged. Many of us who attended Corinthian are in worse financial condition than before we started school. We cannot get jobs that would allow us to pay this astronomical debt, not with the so-called degree with the name of a fraudulent school on it! This is not the dream that we were in search of when we enrolled in college. Corinthian promised us a quality education as well as job placement, but we received neither.  Corinthian and the investors who funded it should be paying our debts, and they should pay for us to get an education from a reputable college that is not-for-profit and that is regionally accredited. This is only fair since they robbed us of our dreams with their fraudulent practices and left us with nothing but extreme debt.  They lined their pockets with our lifetime educational funding. They have fat pockets while we drown in the worst debt imaginable. Free quality education should be available to all people!","image":""},
{"name":"Ashlee Schmidt, Springhill FL","bio":"In 2009 I enrolled in Everest to earn a degree in Medical Billing and Coding. I believed in the American Dream and that education was the key to achieving it. I was the first person in my family to attend college. I wanted to make my family proud and be able to take care of my disabled father. I studied hard and earned a 4.0 grade point average at Everest. Today, however, I am unemployed and can't find a job. I believe that Everest defrauded me. I filled out a single FAFSA form, and they continually took out loans in my name without my knowledge. (The tuition at Everest was so high that I also had to take out private Genesis loans just to stay in school. Everest also tried to get my father to co-sign for even more loans, but I refused.) After graduation, I discovered that Everest took out as many as 13 loans in my name. I now owe $36,412. Now Corinthian is being sued for predatory lending. But the Department of Education has so far refused to cancel these debts. I am harassed by debt collectors on a regular basis. Corinthian and the investors who got rich off my Federal loans have suffered no consequences. Instead, the Department of Education is helping the company avoid punishment. I am on strike because the only way out of this debt is to join with others in my situation. I can't pay, and I won't pay. The Department of Education should cancel our debt and provide a quality, free education to everyone.","image":""},
{"name":"Courtney Scott, Chesapeake, Virginia","bio":"I enrolled in Everest to earn a degree in a health care field because I wanted to help others and support my family. Everest promised me job placement and said they could work around my schedule. Soon after I enrolled, my son was diagnosed with a serious illness. I tried to get a Leave of Absence because I needed time off to take my son to doctors' appointments. Everest denied my request for a leave. Then they dropped me from the program because I missed too many classes. I now have eight thousand dollars in debt that I can't repay. And I found out that Everest is being sued for predatory lending and that thousands of students around the country are struggling like me. The Department of Education should step in and cancel this debt. Instead, they are supporting the company that was more interested in profit than in my son's life. I am joining with others to strike my student loans. I can't pay and I won't pay this illegitimate debt.","image":""}
]