[
  {
    "name":"Makenzie Vasquez",
    "bio":"I’m Makenzie from Santa Cruz , CA. I have $40,000 in debt from Everest. And I'm currently in default. College was foreign territory for me. Neither of my parents attended, so I was on my own when it came to understanding how the system works. This was supposed to be a chance to make something of myself and to one day provide for my own family. Corinthian (Everest’s parent company) did a great job making me believe that they cared. I trusted them, and why not? Why would education fail me? Education is supposed to lead to the American Dream. I studied hard and did everything right. But Everest stole all my Federal funding. They stole money from me that I didn’t even have, money that I can’t - and won’t - pay back. These debts are illegitimate because I never should have been charged that much to attend school in the first place. A school that sold me a Dream that turned out to be a Nightmare. But the Department of Education refuses to cancel my loans. They are continuing to allow these schools to collect this money for a bogus degree. Who should have to pay for Corinthian’s crimes? Not me. We (the people) are the victims here. Why are we allowing this company to have mores right than we do? How about Wells Fargo, Corinthian’s largest investor? Wells Fargo is a billion dollar corporation that profited from poverty. They should have to pay to cancel all Corinthian loans and fund free college for everyone led into this student debt trap. Let's make sure they are held accountable!",
    "image":"http://i.imgur.com/l0BVRBw.jpg"
  },
  {
    "name":"Nathan Hornes",
    "bio":"I’m from Los Angeles, CA. I graduated from Everest with a Bachelor’s degree in Business and a 3.9 GPA. But today I work two minimum wage jobs. I often work 18-hour days, because I cannot afford to pay my loans. I owe $78,000 in student loan debt even though Everest is being sued for fraud. Still, the DoE has refused to cancel my debt. I want to know -- why is the Department of Education supporting a scam for-profit school instead of students? I am on strike because I deserve a full refund and a free education. I co-founded a group called the Everest Avengers where Corinthian students are planning a long-term battle against Corinthian and the Department of Ed. There are 40 million student debtors across the country. This is only the beginning. If we all join together, imagine how much power we would have to end student debt for good.",
    "image":"http://blog.debtcollective.org/content/images/2014/11/Nathan_small.jpg"
  },
  {
    "name":"Latonya Suggs",
    "bio":"I’m from Cincinnati, Ohio. I was excited to attend Everest College online because they promised to help me find a well-paying career. But they lied to me and stole my money. Not only did the school fail me, but the Department of Education failed me because it is their responsibility to make sure that these schools provide a quality education at an affordable cost at a scam-free school. I took out $40,000 in loans so that I could make a better life for my infant son. I earned a criminal justice degree that most employers do not even recognize. After college, I took a job as a housekeeper making barely over minimum wage. I am completely lost and in debt. The only solution is for the Department of Education to discharge my loan so I can start over. I deserve free tuition for the time I wasted. In fact, all student debtors should join together to demand debt cancellation and free education. We are not going to stop fighting until we win. That’s what this strike is about.",
    "image":"http://i.imgur.com/g3lRHrW.jpg"
  }
]